fuzzedpackages/lavaSearch2/inst/likelihood-derivatives-LVM/likelihood-derivatives-LVM.org
#+TITLE: Likelihood, first and second order derivatives in a LVM
#+AUTHOR: Brice Ozenne
#+DATE: 

In this document, we show the expression of the likelihood, its first
two derivatives, the information matrix, and the first derivative of
the information matrix.

* Likelihood

At the individual level, the measurement and structural models can be written:
#+BEGIN_EXPORT LaTeX
\begin{align*}
\VY_i &= \nu + \Veta_i \Lambda + \VX_i K + \Vvarepsilon_i \\
\Veta_i &= \alpha + \Veta_i B + \VX_i \Gamma + \boldsymbol{\zeta}_i 
\end{align*}
\begin{tabular}{lll}
with & \(\Sigma_{\epsilon}\)   &the variance-covariance matrix of the residuals \(\Vvarepsilon_i\)\\
     & \(\Sigma_{\zeta}\) & the variance-covariance matrix of the residuals \(\boldsymbol{\zeta}_i\). \\
\end{tabular}
#+END_EXPORT

\bigskip

By combining the previous equations, we can get an expression for
\(\VY_i\) that does not depend on \(\Veta_i\):
#+BEGIN_EXPORT LaTeX
\begin{align*}
\VY_i &= \nu + \left(\boldsymbol{\zeta}_i + \alpha + \VX_i \Gamma \right) (I-B)^{-1} \Lambda + \VX_i K + \Vvarepsilon_i 
\end{align*}
#+END_EXPORT
Since \(\Var[Ax] = A \Var[x] \trans{A}\) we have \(\Var[xA] =
\trans{A} \Var[x] A\), we have the following expressions for the
conditional mean and variance of \(\VY_i\):
#+BEGIN_EXPORT LaTeX
\begin{align*}
 \Vmu(\Vparam,\VX_i) &= E[\VY_i|\VX_i] = \nu + (\alpha + \VX_i \Gamma) (1-B)^{-1} \Lambda + \VX_i K \\
\Omega(\Vparam) &= Var[\VY_i|\VX_i] = \Lambda^t (1-B)^{-t}  \Sigma_{\zeta} (1-B)^{-1} \Lambda + \Sigma_{\varepsilon} 
\end{align*}
#+END_EXPORT

\bigskip
 
where \(\Vparam\) is the collection of all parameters. The
log-likelihood can be written:
 #+BEGIN_EXPORT LaTeX
\begin{align*}
l(\Vparam|\VY,\VX) &= \sum_{i=1}^n l(\Vparam|\VY_i,\VX_i) \\
&= \sum_{i=1}^{n} - \frac{p}{2} log(2\pi) - \frac{1}{2} log|\Omega(\Vparam)| - \frac{1}{2} (\VY_i-\Vmu(\Vparam,\VX_i)) \Omega(\Vparam)^{-1} \trans{(\VY_i-\Vmu(\Vparam,\VX_i))}
\end{align*}
 #+END_EXPORT

