fuzzedpackages/lavaSearch2/inst/likelihood-derivatives-LVM/likelihood-derivatives-LVM.tex

\section{Partial derivative for the conditional mean and variance}
\label{sec:orgef944c3}

In the following, we denote by \(\delta_{\sigma \in \Sigma}\) the
indicator matrix taking value 1 at the position of \(\sigma\) in the
matrix \(\Sigma\). For instance:
\begin{align*}
\Sigma =
\begin{bmatrix}
 \sigma_{1,1} & \sigma_{1,2} & \sigma_{1,3} \\
 \sigma_{1,2} & \sigma_{2,2} & \sigma_{2,3} \\
 \sigma_{1,3} & \sigma_{2,3} & \sigma_{3,3} \\
\end{bmatrix}
 \qquad 
\delta_{\sigma_{1,2} \in \Sigma} =
\begin{bmatrix}
0 & 1 & 0 \\
1 & 0 & 0 \\
0 & 0 & 0 \\
\end{bmatrix}
\end{align*}
The same goes for \(\delta_{\lambda \in \Lambda}\), \(\delta_{b \in
B}\), and \(\delta_{\psi \in \Psi}\). 

\bigskip

First order derivatives:
\begin{align*}
 \frac{\partial \Vmu(\Vparam,\VX_i)}{\partial \nu} &= 1 \\
 \frac{\partial \Vmu(\Vparam,\VX_i)}{\partial K} &= \VX_i \\
 \frac{\partial \Vmu(\Vparam,\VX_i)}{\partial \alpha} &= (1-B)^{-1}\Lambda \\
 \frac{\partial \Vmu(\Vparam,\VX_i)}{\partial \Gamma} &= \VX_i(1-B)^{-1}\Lambda \\
 \frac{\partial \Vmu(\Vparam,\VX_i)}{\partial \lambda} &= (\alpha + \VX_i \Gamma)(1-B)^{-1}\delta_{\lambda \in \Lambda} \\
 \frac{\partial \Vmu(\Vparam,\VX_i)}{\partial b} &= (\alpha + \VX_i \Gamma)(1-B)^{-1}\delta_{b \in B}(1-B)^{-1}\Lambda \\
 &\\
 \frac{\partial \Omega(\Vparam)}{\partial \psi} &= \Lambda^t (1-B)^{-t} \delta_{\psi \in \Psi} (1-B)^{-1} \Lambda \\
 \frac{\partial \Omega(\Vparam)}{\partial \sigma} &= \delta_{\sigma \in \Sigma} \\
 \frac{\partial \Omega(\Vparam)}{\partial \lambda} &= \delta_{\lambda \in \Lambda}^t (1-B)^{-t} \Psi (1-B)^{-1} \Lambda + \Lambda^t (1-B)^{-t} \Psi (1-B)^{-1} \delta_{\lambda \in \Lambda} \\
 \frac{\partial \Omega(\Vparam)}{\partial b} &= \Lambda^t (1-B)^{-t} \delta_{b \in B}^t (1-B)^{-t} \Psi (1-B)^{-1} \Lambda + \Lambda^t (1-B)^{-t} \Psi (1-B)^{-1} \delta_{b \in B} (1-B)^{-1} \Lambda\\
\end{align*}

Second order derivatives:
\begin{align*}
 \frac{\partial^2 \Vmu(\Vparam,\VX_i)}{\partial \alpha \partial b} &= \delta_{\alpha} (1-B)^{-1} \delta_{b \in B} (1-B)^{-1} \Lambda \\
 \frac{\partial^2 \Vmu(\Vparam,\VX_i)}{\partial \alpha \partial \lambda} &= \delta_{\alpha} (1-B)^{-1} \delta_{\lambda \in \Lambda} \\
 \frac{\partial^2 \Vmu(\Vparam,\VX_i)}{\partial \Gamma \partial b} &= \VX_i (1-B)^{-1} \delta_{b \in B} (1-B)^{-1} \Lambda \\
 \frac{\partial^2 \Vmu(\Vparam,\VX_i)}{\partial \Gamma \partial \lambda} &= \VX_i (1-B)^{-1} \delta_{\lambda \in \Lambda} \\
 \frac{\partial^2 \Vmu(\Vparam,\VX_i)}{\partial \lambda \partial b } &=  (\alpha + \VX_i \Gamma)(1-B)^{-1} \delta_{b \in B} (1-B)^{-1} \delta_{\lambda \in \Lambda} \\
 \frac{\partial^2 \Vmu(\Vparam,\VX_i)}{\partial b \partial b'} &= (\alpha + \VX_i \Gamma)(1-B)^{-1}\delta_{b' \in B}(1-B)^{-1}\delta_{b \in B}(1-B)^{-1}\Lambda \\
& + (\alpha + \VX_i \Gamma)(1-B)^{-1}\delta_{b \in B}(1-B)^{-1}\delta_{b' \in B}(1-B)^{-1}\Lambda  \\
& \\
 \frac{\partial^2 \Omega(\Vparam)}{\partial \psi \partial \lambda} &=  \delta_{\lambda \in \Lambda}^t (1-B)^{-t} \delta_{\psi \in \Psi} (1-B)^{-1} \Lambda  \\
& + \Lambda^t (1-B)^{-t} \delta_{\psi \in \Psi} (1-B)^{-1} \delta_{\lambda \in \Lambda}  \\
 \frac{\partial^2 \Omega(\Vparam)}{\partial \psi \partial b} &= \Lambda^t (1-B)^{-t} \delta^t_{b \in B} (1-B)^{-t} \delta_{\psi \in \Psi} (1-B)^{-1} \Lambda \\
& + \Lambda^t (1-B)^{-t} \delta_{\psi \in \Psi} (1-B)^{-1} \delta_{b \in B} (1-B)^{-1} \Lambda  \\
 \frac{\partial^2 \Omega(\Vparam)}{\partial \lambda \partial b} &= \delta_{\lambda \in \Lambda}^t (1-B)^{-t} \delta^t_{b \in B} (1-B)^{-t} \Psi (1-B)^{-1} \Lambda \\
& + \delta_{\lambda \in \Lambda}^t (1-B)^{-t} \Psi (1-B)^{-1} \delta^t_{b \in B} (1-B)^{-1} \Lambda \\
& + \Lambda^t (1-B)^{-t} \delta^t_{b \in B} (1-B)^{-t} \Psi (1-B)^{-1} \delta_{\lambda \in \Lambda} \\
& + \Lambda^t (1-B)^{-t}  \Psi (1-B)^{-1} \delta^t_{b \in B} (1-B)^{-1} \delta_{\lambda \in \Lambda}  \\
 \frac{\partial^2 \Omega(\Vparam)}{\partial \lambda \partial \lambda'} &= \delta_{\lambda \in \Lambda}^t (1-B)^{-t} \Psi (1-B)^{-1} \delta_{\lambda' \in \Lambda} \\
& + \delta_{\lambda' \in \Lambda}^t (1-B)^{-t} \Psi (1-B)^{-1} \delta_{\lambda \in \Lambda}   \\
 \frac{\partial^2 \Omega(\Vparam)}{\partial b \partial b'} &= \Lambda^t (1-B)^{-t} \delta_{b' \in B}^t (1-B)^{-t} \delta_{b \in B}^t (1-B)^{-t} \Psi (1-B)^{-1} \Lambda \\
& + \Lambda^t (1-B)^{-t} \delta_{b \in B}^t (1-B)^{-t} \delta_{b' \in B}^t (1-B)^{-t} \Psi (1-B)^{-1} \Lambda \\
& + \Lambda^t (1-B)^{-t} \delta_{b \in B}^t (1-B)^{-t} \Psi (1-B)^{-1} \delta_{b' \in B} (1-B)^{-1} \Lambda \\
& + \Lambda^t (1-B)^{-t} \delta_{b' \in B}^t (1-B)^{-t} \Psi (1-B)^{-1} \delta_{b \in B} (1-B)^{-1} \Lambda \\
& + \Lambda^t (1-B)^{-t} \Psi (1-B)^{-1} \delta_{b' \in B} (1-B)^{-1} \delta_{b \in B} (1-B)^{-1} \Lambda \\
& + \Lambda^t (1-B)^{-t} \Psi (1-B)^{-1} \delta_{b \in B} (1-B)^{-1} \delta_{b' \in B} (1-B)^{-1} \Lambda \\
\end{align*}
\section{First derivative: score}
\label{sec:orga852a0f}
The individual score is obtained by derivating the log-likelihood:
\begin{align*}
   \Score(\param|\VY_i,\VX_i) =& \dpartial{l_i(\Vparam|\VY_i,\VX_i)}{\param}\\
 =& - \frac{1}{2} tr\left(\Omega(\Vparam)^{-1} \dpartial{\Omega(\Vparam)}{\param}\right) \\
 &+  \dpartial{\Vmu(\Vparam,\VX_i)}{\param} \Omega(\Vparam)^{-1} \trans{(\VY_i-\Vmu(\Vparam,\VX_i))} \\
 &+ \frac{1}{2} (\VY_i-\Vmu(\Vparam,\VX_i)) \Omega(\Vparam)^{-1} \dpartial{\Omega(\Vparam)}{\param} \Omega(\Vparam)^{-1} \trans{(\VY_i-\Vmu(\Vparam,\VX_i))}
\end{align*}
