fuzzedpackages/lavaSearch2/inst/likelihood-derivatives-LVM/likelihood-derivatives-LVM.org
* Second derivative: Hessian and expected information
:PROPERTIES:
:CUSTOM_ID: SM:Information
:END:
The individual Hessian is obtained by derivating twice the
log-likelihood:
#+BEGIN_EXPORT LaTeX
\begin{align*}
   \Hessian_i(\param,\param') =& -\frac{1}{2} tr\left(-\Omega(\Vparam)^{-1} \dpartial{\Omega(\Vparam)}{\param'} \Omega(\Vparam)^{-1} \frac{\partial \Omega(\Vparam)}{\partial \param} + \Omega(\Vparam)^{-1} \frac{\partial^2 \Omega(\Vparam)}{\partial \param \partial \param'}\right) \\
 &+  \frac{\partial^2 \Vmu(\Vparam,\VX_i)}{\partial \param \partial \param'} \Omega(\Vparam)^{-1} \trans{(\VY_i-\Vmu(\Vparam,\VX_i))} \\
 &-  \dpartial{\Vmu(\Vparam,\VX_i)}{\param} \Omega(\Vparam)^{-1} \dpartial{\Omega(\Vparam)}{\param'} \Omega(\Vparam)^{-1} \trans{(\VY_i-\Vmu(\Vparam,\VX_i))} \\
 &-  \dpartial{\Vmu(\Vparam,\VX_i)}{\param} \Omega(\Vparam)^{-1} \trans{\dpartial{\Vmu(\Vparam,\VX_i)}{\param'}} \\
 &-  \dpartial{\Vmu(\Vparam,\VX_i)}{\param'} \Omega(\Vparam)^{-1} \dpartial{\Omega(\Vparam)}{\param} \Omega(\Vparam)^{-1} \trans{(\VY_i-\Vmu(\Vparam,\VX_i))}  \\
 &-  (\VY_i-\Vmu(\Vparam,\VX_i)) \Omega(\Vparam)^{-1} \dpartial{\Omega(\Vparam)}{\param'} \Omega(\Vparam)^{-1} \frac{\partial \Omega(\Vparam)}{\partial \param} \Omega(\Vparam)^{-1} \trans{(\VY_i-\Vmu(\Vparam,\VX_i))} \\
 &+ \frac{1}{2} (\VY_i-\Vmu(\Vparam,\VX_i)) \Omega(\Vparam)^{-1} \frac{\partial^2 \Omega(\Vparam)}{\partial \param \partial \param'} \Omega(\Vparam)^{-1} \trans{(\VY_i-\Vmu(\Vparam,\VX_i))} \\
\end{align*}
#+END_EXPORT

\clearpage

Using that \(\Vmu(\param,\VX_i)\) and \(\Omega(\Vparam)\) are deterministic quantities,
we can then take the expectation to obtain:
#+BEGIN_EXPORT LaTeX
\begin{align*}
\Esp\left[\Hessian_i(\param,\param')\right] =& -\frac{1}{2} tr\left(-\Omega(\Vparam)^{-1} \dpartial{\Omega(\Vparam)}{\param'} \Omega(\Vparam)^{-1} \frac{\partial \Omega(\Vparam)}{\partial \Vparam} + \Omega(\param)^{-1} \frac{\partial^2 \Omega(\Vparam)}{\partial \param \partial \param'}\right) \\
 &+  \frac{\partial^2 \Vmu(\Vparam,\VX_i)}{\partial \param \partial \param'} \Omega(\Vparam)^{-1} \Ccancelto[red]{0}{\Esp\left[\trans{(\VY_i-\Vmu(\Vparam,\VX_i))}\right]} \\
 &-  \dpartial{\Vmu(\Vparam,\VX_i)}{\param} \Omega(\Vparam)^{-1} \dpartial{\Omega(\Vparam)}{\param'} \Omega(\Vparam)^{-1} \Ccancelto[red]{0}{\Esp\left[\trans{(\VY_i-\Vmu(\Vparam,\VX_i))}\right]} \\
 &-  \dpartial{\Vmu(\Vparam,\VX_i)}{\param} \Omega(\Vparam)^{-1} \trans{\dpartial{\Vmu(\Vparam)}{\param'}} \\
 &-  \dpartial{\Vmu(\Vparam,\VX_i)}{\param'} \Omega(\Vparam)^{-1} \dpartial{\Omega(\Vparam)}{\param} \Omega(\Vparam)^{-1} \Ccancelto[red]{0}{\Esp\left[\trans{(\VY_i-\Vmu(\Vparam,\VX_i))}\right]}  \\
 &-  \Esp\left[(\VY_i-\Vmu(\Vparam,\VX_i)) \Omega(\Vparam)^{-1} \dpartial{\Omega(\Vparam)}{\param'} \Omega(\Vparam)^{-1} \frac{\partial \Omega(\Vparam)}{\partial \param} \Omega(\Vparam)^{-1} \trans{(\VY_i-\Vmu(\Vparam,\VX_i))}\right] \\
 &+ \Esp \left[\frac{1}{2} (\VY_i-\Vmu(\Vparam,\VX_i)) \Omega(\Vparam)^{-1} \frac{\partial^2 \Omega(\Vparam)}{\partial \param \partial \param'} \Omega(\Vparam)^{-1} \trans{(\VY_i-\Vmu(\Vparam,\VX_i))}\right] \\
\end{align*}
#+END_EXPORT

The last two expectations can be re-written using that \(\Esp[\trans{x}Ax] = tr\left(A\Var[x]\right)+\trans{\Esp[x]}A\Esp[x]\):
#+BEGIN_EXPORT LaTeX
\begin{align*}
\Esp\left[\Hessian_i(\param,\param')\right] =& -\frac{1}{2} tr\left(-\Omega(\Vparam)^{-1} \dpartial{\Omega(\Vparam)}{\param'} \Omega(\Vparam)^{-1} \frac{\partial \Omega(\Vparam)}{\partial \param} + \Ccancel[red]{\Omega(\Vparam)^{-1} \frac{\partial^2 \Omega(\Vparam)}{\partial \param \partial \param'}}\right) \\
 &-  \frac{\partial \Vmu(\Vparam,\VX_i)}{\partial \param} \Omega(\Vparam)^{-1} \trans{\frac{\partial \Vmu(\Vparam,\VX_i)}{\partial \param'}} \\
 &- tr\left(\Omega(\Vparam)^{-1} \frac{\partial \Omega(\Vparam)}{\partial \param'} \Omega(\Vparam)^{-1} \frac{\partial \Omega(\Vparam)}{\partial \param} \Omega(\Vparam)^{-1} \trans{\left(\Var\left[\VY_i-\Vmu(\Vparam,\VX_i)\right]\right)} \right) \\
 &+ \Ccancel[red]{\frac{1}{2} tr\left( \Omega(\Vparam)^{-1} \frac{\partial^2 \Omega(\Vparam)}{\partial \param \partial \param'} \Ccancel[blue]{\Omega(\Vparam)^{-1}} \Ccancel[blue]{\trans{\left(\Var\left[\VY_i-\Vmu(\Vparam,\VX_i)\right]\right)}} \right)} \\
\end{align*}
#+END_EXPORT
where we have used that \(\Var\left[\VY_i-\Vmu(\Vparam,\VX_i)\right] =
\Var\left[\VY_i|\VX_i\right] = \Omega(\Vparam)\). Finally we get:
#+BEGIN_EXPORT LaTeX
\begin{align*}
\Esp\left[\Hessian_i(\param,\param')\right] =& -\frac{1}{2} tr\left(\Omega(\Vparam)^{-1} \dpartial{\Omega(\Vparam)}{\param'} \Omega(\Vparam)^{-1} \dpartial{\Omega(\Vparam)}{\param}\right) \\
 &-  \dpartial{\Vmu(\Vparam,\VX_i)}{\param} \Omega(\Vparam)^{-1} \trans{\dpartial{\Vmu(\Vparam,\VX_i)}{\param'}} \\
\end{align*}
#+END_EXPORT
So we can deduce from the previous equation the expected information matrix:
#+BEGIN_EXPORT LaTeX
\begin{align*}
\Information(\param,\param') =& \frac{n}{2} tr\left(\Omega(\Vparam)^{-1} \dpartial{\Omega(\Vparam)}{\param'} \Omega(\Vparam)^{-1} \frac{\partial \Omega(\Vparam)}{\partial \param}\right) 
 + \sum_{i=1}^n \dpartial{\Vmu(\Vparam,\VX_i)}{\param} \Omega(\Vparam)^{-1} \trans{\dpartial{\Vmu(\Vparam,\VX_i)}{\param'}}
\end{align*}
#+END_EXPORT

* First derivatives of the information matrix
#+BEGIN_EXPORT LaTeX
\begin{align*}
\frac{\partial \Information(\param,\param')}{\partial \param''} 
=& - \frac{n}{2} tr\left(\Omega(\Vparam)^{-1} \frac{\partial \Omega(\Vparam)}{\partial \param''} \Omega(\Vparam)^{-1} \frac{\partial \Omega(\Vparam)}{\partial \param} \Omega(\Vparam)^{-1} \frac{\partial \Omega(\Vparam)}{\partial \param'}\right) \\
& + \frac{n}{2} tr\left( \Omega(\Vparam)^{-1} \frac{\partial^2 \Omega(\Vparam)}{\partial\param\partial\param''} \Omega(\Vparam)^{-1} \frac{\partial \Omega(\Vparam)}{\partial \param'}\right) \\
& - \frac{n}{2} tr\left(\Omega(\Vparam)^{-1} \frac{\partial \Omega(\Vparam)}{\partial \param} \Omega(\Vparam)^{-1} \frac{\partial \Omega(\Vparam)}{\partial \param''} \Omega(\Vparam)^{-1} \frac{\partial \Omega(\Vparam)}{\partial \param'}\right) \\
& + \frac{n}{2} tr\left( \Omega(\Vparam)^{-1} \frac{\partial \Omega(\Vparam)}{\partial\param} \Omega(\Vparam)^{-1} \frac{\partial^2 \Omega(\Vparam)}{\partial \param' \partial \param''}\right) \\
& + \sum_{i=1}^n \frac{\partial^2 \Vmu(\Vparam,\VX_i)}{\partial\param\partial\param''} \Omega(\Vparam)^{-1} \trans{\dpartial{\Vmu(\Vparam,\VX_i)}{\param'}} \\
& + \sum_{i=1}^n \frac{\partial \Vmu(\Vparam,\VX_i)}{\partial \param} \Omega(\Vparam)^{-1} \trans{\ddpartial{\Vmu(\Vparam,\VX_i)}{\Vparam'}{\param''}} \\
& - \sum_{i=1}^n \frac{\partial \Vmu(\Vparam,\VX_i)}{\partial \param} \Omega(\Vparam)^{-1} \frac{\partial \Omega(\Vparam)}{\partial \param''} \Omega(\Vparam)^{-1} \trans{\dpartial{\Vmu(\Vparam,\VX_i)}{\param'}} \\
\end{align*}
#+END_EXPORT


* Config                                                           :noexport:

#+LANGUAGE:  en
#+LaTeX_CLASS: org-article
#+OPTIONS: author:t date:nil todo:t title:t toc:nil
#+LaTeX_class_options: [table] 
#+STARTUP: content

** R code 
#+PROPERTY: session *R*

** Margins and space between lines
# ## set margin
#+LATEX_HEADER: \geometry{innermargin=1.5in,outermargin=1.25in,vmargin=3cm}
# ## set space between lines
#+LATEX_HEADER: \linespread{1.4}

** Figures
#+LATEX_HEADER: \usepackage{epstopdf} % to be able to convert .eps to .pdf image files
#+LATEX_HEADER: \renewcommand{\thefigure}{S\arabic{figure}}
#+LATEX_HEADER: \renewcommand{\thetable}{S\arabic{table}}
#+LATEX_HEADER: \renewcommand{\theequation}{S\arabic{equation}}

# # for figure S1
#+LaTeX_HEADER: \usepackage{caption}
#+LaTeX_HEADER: \usepackage[labelformat=simple]{subcaption}
#+LaTeX_HEADER: \renewcommand{\thesubfigure}{Study \Alph{subfigure}}

** Tables 
#+LaTeX_HEADER: \usepackage{booktabs}

** Algorithm
#+LATEX_HEADER: \usepackage{algorithm2e}
#+LaTeX_HEADER: \usepackage{amsthm}
 
